4.1 Getting data via public data sources - Kaggle
======

**Titanic extended dataset**

**We will experiment with the Titanic passenger list data. The Titanic extended dataset (Kaggle + Wikipedia)
https://www.kaggle.com/pavlofesenko/titanic-extended
has more features and data than the usual Titanic dataset such as the one in the Titanic R package and https://www.kaggle.com/c/titanic/data.**

Download the titanic_full.csv file from the Kaggle page. Import python library. Read data from csv file. Check and inspect data frame.

In [1]:
# import pandas python library
import pandas as pd 
# Read data from file 
titanic_full = pd.read_csv("titanic_full.csv") 
# Preview the first 5 lines of the loaded data 
print(titanic_full.head())
# show data frame dimension
print(titanic_full.shape)

   PassengerId  Survived  Pclass  \
0            1       0.0       3
1            2       1.0       1
2            3       1.0       3
3            4       1.0       1
4            5       0.0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare  ... Embarked WikiId  \
0      0         A/5 21171   7.2500  ...        S  691.0
1      0          PC 17599  71.2833  ...        C   90.0
2      0  STON/O2. 3101282   7.9250  ...        S  865.0
3      0            113803  53.1000  ...        S  127.0
4      0            373450   8.0500  ...        S  627.0

                                    Name_wiki Age_wiki  \
0                     Braund, Mr. Owen Harris     22.0
1  Cumings, Mrs. Florence Briggs (née Thayer)     35.0
2                       Heikkinen, Miss Laina     26.0
3          Futrelle, Mrs. Lily May (née Peel)     35.0
4                    Allen, Mr. William Henry     35.0

                             Hometown      Boarded  \
0          Bridgerule, Devon, England  Southampton
1              New York, New York, US    Cherbourg
2                  Jyväskylä, Finland  Southampton
3         Scituate, Massachusetts, US  Southampton
4  Birmingham, West Midlands, England  Southampton

                               Destination Lifeboat Body Class
0  Qu'Appelle Valley, Saskatchewan, Canada      NaN  NaN   3.0
1                   New York, New York, US        4  NaN   1.0
2                            New York City      14?  NaN   3.0
3              Scituate, Massachusetts, US        D  NaN   1.0
4                            New York City      NaN  NaN   3.0

[5 rows x 21 columns]
(1309, 21)

4.2 Kaggle data preparation and cleaning
======

4.2.1 Titanic extended dataset
------
Titanic extended dataset
https://www.kaggle.com/pavlofesenko/titanic-extended

**The Titanic extended dataset includes extra age data in Age_wiki. We will remove the Age field, use Age_wiki as Age, and keep Survived, Sex, SibSp, PClass, Parch, Fare, Embarked, Lifeboat etc data for data processing and visualisation later.**

**Check columns with null value.**

In [2]:
# check columns with null value
na_report = titanic_full.isnull().sum()
print(na_report)

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
WikiId            5
Name_wiki         5
Age_wiki          7
Hometown          5
Boarded           5
Destination       5
Lifeboat        807
Body           1179
Class             5
dtype: int64

**Remove rows with null in suvivied data column.**

In [3]:
# remove rows with null suvivied data
titanic_clean = titanic_full[~titanic_full['Survived'].isnull()]
# check data again
print(titanic_clean.shape)
na_report = titanic_clean.isnull().sum()
print(na_report)

(891, 21)
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
WikiId           2
Name_wiki        2
Age_wiki         4
Hometown         2
Boarded          2
Destination      2
Lifeboat       546
Body           804
Class            2
dtype: int64

**Select subset of columns from the data for data analysis.**

In [4]:
# select subset of columns from data
titanic_clean = titanic_clean[['Survived', 'Sex', 'Pclass', 'Age_wiki', 'Fare', 'SibSp', 'Parch', 'Embarked', 'Lifeboat', 'Cabin']]
print(titanic_clean.head())

   Survived     Sex  Pclass  Age_wiki     Fare  SibSp  Parch Embarked  \
0       0.0    male       3      22.0   7.2500      1      0        S
1       1.0  female       1      35.0  71.2833      1      0        C
2       1.0  female       3      26.0   7.9250      0      0        S
3       1.0  female       1      35.0  53.1000      1      0        S
4       0.0    male       3      35.0   8.0500      0      0        S

  Lifeboat Cabin
0      NaN   NaN
1        4   C85
2      14?   NaN
3        D  C123
4      NaN   NaN

**Create family size data from SibSp (Number of Siblings/Spouses Aboard) and Parch (Number of Parents/Children)**

In [5]:
# create family size data column
titanic_clean['FamilySize'] = titanic_clean['SibSp'] + titanic_clean['Parch']+1
print(titanic_clean.head())

   Survived     Sex  Pclass  Age_wiki     Fare  SibSp  Parch Embarked  \
0       0.0    male       3      22.0   7.2500      1      0        S
1       1.0  female       1      35.0  71.2833      1      0        C
2       1.0  female       3      26.0   7.9250      0      0        S
3       1.0  female       1      35.0  53.1000      1      0        S
4       0.0    male       3      35.0   8.0500      0      0        S

  Lifeboat Cabin  FamilySize
0      NaN   NaN           2
1        4   C85           2
2      14?   NaN           1
3        D  C123           2
4      NaN   NaN           1

**Fill empty age data with media age from the Sex and Pclass group**

In [6]:
# fill age data with media age from the Sex and Pclass group
titanic_clean.Age_wiki.fillna(titanic_clean.groupby(['Sex','Pclass']).transform('median').Age_wiki, inplace=True)

**Check columns with null value again.**

In [7]:
# check data with null
na_report = titanic_clean.isnull().sum()
print(na_report)

Survived        0
Sex             0
Pclass          0
Age_wiki        0
Fare            0
SibSp           0
Parch           0
Embarked        2
Lifeboat      546
Cabin         687
FamilySize      0
dtype: int64

**Fill all NA data with X. Check columns with null value again.**

In [8]:
# fill na lifeboat with X
titanic_clean.Lifeboat.fillna('X', inplace=True)
# fill na Cabin with X
titanic_clean.Cabin.fillna('X', inplace=True)
# fill na Embarked with X
titanic_clean.Embarked.fillna('X', inplace=True)
# rename Age_wiki to Age
titanic_clean.rename(columns = {'Age_wiki':'Age'}, inplace = True) 
# check data again
na_report = titanic_clean.isnull().sum()
print(na_report)
print(titanic_clean.head())

Survived      0
Sex           0
Pclass        0
Age           0
Fare          0
SibSp         0
Parch         0
Embarked      0
Lifeboat      0
Cabin         0
FamilySize    0
dtype: int64
   Survived     Sex  Pclass   Age     Fare  SibSp  Parch Embarked Lifeboat  \
0       0.0    male       3  22.0   7.2500      1      0        S        X
1       1.0  female       1  35.0  71.2833      1      0        C        4
2       1.0  female       3  26.0   7.9250      0      0        S      14?
3       1.0  female       1  35.0  53.1000      1      0        S        D
4       0.0    male       3  35.0   8.0500      0      0        S        X

  Cabin  FamilySize
0     X           2
1   C85           2
2     X           1
3  C123           2
4     X           1

**List lifeboat column unique data values.**

In [9]:
# list lifeboat column unique values
titanic_clean.Lifeboat.unique()

array(['X', '4', '14?', 'D', '15', '?', '13', '8', '14', 'C', '7', '6',
       '3', '16', '12', '10', '11', 'B', '5', 'A', '9', '2', '1'],
      dtype=object)

**Replace data ? with Q in Lifeboat column.**

In [10]:
# replace ? with Q
titanic_clean.loc[titanic_clean['Lifeboat'] =='?', 'Lifeboat'] = 'Q'

**List lifeboat column unique data values again.**

In [11]:
# list values again
titanic_clean.Lifeboat.unique()

array(['X', '4', '14?', 'D', '15', 'Q', '13', '8', '14', 'C', '7', '6',
       '3', '16', '12', '10', '11', 'B', '5', 'A', '9', '2', '1'],
      dtype=object)

**Remove ? in 14?**

In [12]:
# remove ? in 14
titanic_clean['Lifeboat'] = titanic_clean['Lifeboat'].str.replace('?','')
titanic_clean.Lifeboat.unique()

array(['X', '4', '14', 'D', '15', 'Q', '13', '8', 'C', '7', '6', '3',
       '16', '12', '10', '11', 'B', '5', 'A', '9', '2', '1'], dtype=object)

**Convert Survived column data type.**

In [13]:
# convert survived column to int
titanic_clean['Survived'] = titanic_clean['Survived'].astype(int)

In [14]:
print(titanic_clean.head())

   Survived     Sex  Pclass   Age     Fare  SibSp  Parch Embarked Lifeboat  \
0         0    male       3  22.0   7.2500      1      0        S        X
1         1  female       1  35.0  71.2833      1      0        C        4
2         1  female       3  26.0   7.9250      0      0        S       14
3         1  female       1  35.0  53.1000      1      0        S        D
4         0    male       3  35.0   8.0500      0      0        S        X

  Cabin  FamilySize
0     X           2
1   C85           2
2     X           1
3  C123           2
4     X           1

**List cabin column unique values.**

In [15]:
# list cabin column unique values
titanic_clean.Cabin.unique()

array(['X', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

**Keep first character only in the Cabin data.**

In [16]:
# keep first character only in Cabin
import re
titanic_clean['Cabin'] = titanic_clean['Cabin'].str.replace('[^a-zA-Z]', '').str[0]
titanic_clean.Cabin.unique()

array(['X', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

**Check and inspect data.**

In [17]:
# check data with different functions
titanic_clean.describe()

,Survived,Pclass,Age,Fare,SibSp,Parch,FamilySize
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,29.316128,32.204208,0.523008,0.381594,1.904602
std,0.486592,0.836071,13.907032,49.693429,1.102743,0.806057,1.613459
min,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000,1.000000
25%,0.000000,2.000000,20.000000,7.910400,0.000000,0.000000,1.000000
50%,0.000000,3.000000,28.000000,14.454200,0.000000,0.000000,1.000000
75%,1.000000,3.000000,38.000000,31.000000,1.000000,0.000000,2.000000
max,1.000000,3.000000,74.000000,512.329200,8.000000,6.000000,11.000000

In [19]:
# list all columns unique values
def rstr(df): 
    return df.shape, df.apply(lambda x: [x.unique()])
print(rstr(titanic_clean))

((891, 11),   Survived             Sex     Pclass  \
0   [0, 1]  [male, female]  [3, 1, 2]

                                                 Age  \
0  [22.0, 35.0, 26.0, 54.0, 2.0, 14.0, 4.0, 61.0,...

                                                Fare                  SibSp  \
0  [7.25, 71.2833, 7.925, 53.1, 8.05, 8.4583, 51....  [1, 0, 3, 4, 2, 5, 8]

                   Parch      Embarked  \
0  [0, 1, 2, 5, 3, 4, 6]  [S, C, Q, X]

                                            Lifeboat  \
0  [X, 4, 14, D, 15, Q, 13, 8, C, 7, 6, 3, 16, 12...

                         Cabin                    FamilySize
0  [X, C, E, G, D, A, B, F, T]  [2, 1, 5, 3, 7, 6, 4, 8, 11]  )

**Reindex and export dataFrame to cleandata_titanic.csv**

In [20]:
# reindex and export dataFrame to csv
titanic_clean=titanic_clean.reset_index(drop=True)
titanic_clean.to_csv('{}.csv'.format("cleandata_titanic"),index = False, header=True)